"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.stage = {
    name: "Классика",
    internalName: "Уралмаш",
    quests: [
        "Код по результатам прохождения этапа"
    ],
    bonuses: [
        "Насколько тепло было Коле Елизарову, когда он шёл на работу?",
        "Сперва может показаться, что название этого ТЦ - жаргонизм, якобы жители этого района только так и встречаются: твое место, мое время. Но если вдуматься, то на этой же улице есть еще один ТЦ, который затавляет эту пару звучать гордо и имеет непосредственное отношение к улице на которой они оба расположены",
        "Её вершину удалось покорить девушке по имени Карла только спустя 19 лет после 16 лет. Кто её охраняет?"
    ]
};
//# sourceMappingURL=stage_0.js.map