var all_text:{stages:RawStage[],bonus:RawStage} = {
    stages: [
        {
            name: "Этап «Мост Макарова»",
            quests: [
                `Буря мглою небо кроет,<br> 
Вихри снежные крутя,<br>
Двигайте своей толпою<br>
От Репера до Меня.<br>
Где под кровлей обветшалой<br> 
Древо чудное стоит,<br>
Шахматист – спортсмен бывалый<br>
Там проводит свой гамбит.<br>
Выпьем, добрая подружка,<br>
Нужен номер игрока.<br>
Выпьем с горя; Где же кружка?<br>
Я за кружкой. Всем пока.`,
                `Представьте: exp((-(((x-4)^2+(y-4)^2)^2))/1000)+exp((-(((x+4)^2+(y+4)^2)^2))/1000)+0.15*exp(-(((x+4)^2+(y+4)^2)^2))+0.15*exp(-(((x-4)^2+(y-4)^2)^2)) 
Представили? Возьмите только одну. Подойдите в плотную к морю. Что делал никнейм, когда кто-то ложился спать?`,
                `Эта улица меняла свое название несколько раз. Последнее переименование позже стало связано с УрГУ. Найдите центр улицы. Какой правильный многогранник можно вписать в основание конструкции возле?`,
                "В конце своих приключений Буратино приобрел его, который обязательно бы подошёл к нему. Крупнейшая в Екатеринбурге выставка их соединяет два музея. Переехавший относительно недавно каменный мужик смотрит на нужный. Какой ползучий гад спрятался на камнях возле?",
                `Аудиофайл. Загадано место. Сколько перьев, торчащих из клетки имеют спираль?
<br>
<iframe width="280" height="157" src="https://www.youtube.com/embed/yRrJDeh4x-w" frameborder="0" allowfullscreen></iframe>

<br>
<br>
<a style="text-decoration:underline !important" href="https://youtu.be/yRrJDeh4x-w">YouTube link</a>
                `,
                "Единственный NPC в квесте. На Набережной Рабочей Молодёжи между домами 1 и 3 стоит белый фольксваген 898, там всю команду ждёт Петенька."
            ]
        },
        {
            name: "Этап «Физра не в Павлике»",
            quests: [
                "Сколько ещё говядины надо добавить, чтобы про них можно было петь песню?<br><img style='height: auto;width: auto; max-width: 250px;max-height: 250px;' src='/statics/letters.png'/>",
                "Опытный программист найдёт это место вслепую: (2,5) (2,8) (2,7) (1,9) (2,4) (2,9) (3,7)         (2,7) (3,8) (2,7) (2,6) (2,7) (1,6) (2,2). Идите к зданию полному opium des volkes. Сколько трёхмерных гауссиан перед вами?",
                {
                    type: QuestType.UPLOAD, text: `Здесь
<br>
<br>
<img style='height: auto;width: auto; max-width: 200px;max-height: 200px;' src='/statics/sun.png'/>
<br>
найдите самую высокую площадку.
Среди излюбленных предметов бабушек выберите центральный. Сделайте фото, следуя инструкциям.`
                },
                "На улице папиного уральца найдите салон, сочетающий красоту с орфографией. Следуя указателю ароматного пара, разыщите предмет-очевидность. Назовите аргументы коньюкции?",
                "Самое время подкрепиться! Встаньте напротив места, где это можно сделать сыто и с огоньком. Следуя за тем, чего хотят все проигравшие, скажите, какое расстояние от фасада является безопасным?"
            ]
        },
        {
            name: "Этап «тУПИк»",
            quests: [
                "Много ли есть в Екатеринбурге памятников, которые стоят на \"своих\" улицах? На одной из таких улиц мы загадали дом с чётным номером N. N mod 100 + N div 100 +1 = M, где M - номер средней образовательной школы в этом доме. Сколько свободных рук у памятника перед ним?",
                "Это место находится между тремя улицами. Первая названа в честь первого, вторая связана с первым пятого, третья носит имя первого кавалера Ордена Красного Знамени. С третьей улицы загляните внутрь и ответьте, почему запрещён въезд?",
                `
В это сложно поверить, но у Пушкина и вот этих девушек есть нечто общее. 
<br>
<img style='height: auto;width: auto; max-width: 200px;max-height: 200px;' src='/statics/girls.jpg'/>
<br>
Номер этого общего состоит из двух цифр. Первая - второе натуральное число, являющееся третьей степенью какого-либо другого натурального числа; второе – сумма цифр самого известного приближения числа пи.
На северо-западе от него дорожный указатель. Расстояние до медвежьей пади?`,
                `
Попробуем вспомнить теорию вероятности. 
<br>
<br>
<img style='height: auto;width: auto; max-width: 250px;max-height: 250px;' src='/statics/formula.png'/>    
<br>
<br>
Так и быть, от вас не требуется применить это неравенство, но хотя бы автора припомните? :) 
Сюрприз-сюрприз, его именем названа улица в нашем городе! 
А на ближайшей параллельной улице на западе находится небольшая аллейка. 
Посреди неё – техническое здание с граффити, которое вам и нужно. 
Справа от центральной девушки, первые четыре буквы после треугольника? 
`,
                `
Эстафета.<br>
Получаешь фото – делаешь фото в том же месте – отправляешь в чатик – получаешь следующее.<br> 
Меньше 10 минут – 1,5 балла, 10-15 минут – 1 балл, 15-20 минут – 0,5 балла, больше 20 минут – 0 баллов.<br> 
Здесь будет первое фото.
 <br>
 <br>
 Мира 22:
 <br>
<img style='height: auto;width: auto; max-width: 200px;max-height: 200px;' src='/statics/point.jpg'/>  
<a style="text-decoration:underline !important" href="https://pp.vk.me/c630219/v630219250/23f16/Z_6q4GDzGYE.jpg">High resolution link</a>
                `

            ]
        }
    ],
    bonus: {
        name: "Для задротов",
        status: StageStatus.BONUS,
        quests: [
            `Задача на построение: постройте окружность х^2+у^2=1 и вспомогательный график у=-(х^2+у^2)/2. Из (0;0) постройте три единичных отрезка. Первый соедините с (0;1), а второй и третий с точками пересечения окружности и вспомогательного графика. Проверка: единственный телефон заканчивается на 10. Ближайший хозяйственный корпус, номер возле Скрата. 

<br>
<br>
1 балл
`, `
Эта организация носит железнодорожное название, но при этом связана с плавсредствами. Найдите ближайшую стену с самовыражениями на северо-западе. Какого цвета грива у льва?
<br>
<br>
2 балла
            `, `
Именно в стенах этого универа Сизый (это не погоняло!) защищал свою докторскую. Найдите пешеходный мост. Запишите его инвентарный номер в десятичной системе
<br>
<br>
1 балл
            `,
            `
Если вы учились на матмехе, то когда-то вы были (или всё ещё являетесь) ими. В честь них названа одна из улиц Екатеринбурга.
<br>
Дано: равносторонний треугольник, P=18. Загадано место. Сколько всего скамеек было в этом месте по задумке архитектора?
<br>
<img style='height: auto;width: auto; max-width: 250px;max-height: 250px;' src='/statics/triangle.png'/>
<br>
<br>
2 балла
            `,
            `
Встань перед знаком оберега так, чтобы табличка о нём была справа от тебя. 15 шагов вперёд, затем 22 ступеньки по лестнице. Видишь справа две сосны? 
Пройди между ними 35 шагов по тропинке, пока не увидишь булыжник, придавивший сосну. 
Теперь оглянись и иди по направлению к торпеде 20 шагов – окажешься на тропинке. 
Следуй мимо торпеды, пока не увидишь две скамейки. 
Встань между ними и посмотри на восток: тебе к самой дальней группе камней. 
Идёшь верно, если видишь цветные брызги. На перекрестке стоит одинокая сосна. 
От этой сосны по тропинке 100 шагов на север, а потом половину от этого на восток. 
Когда я там шёл – ребята жарили шашлыки. 
Дальше выбери левую дорогу и топай по ней 400 шагов, пока не увидишь справа второй свороток – в нескольких шагах от него точно видел помеченную белым сосну. 
Уже почти пришли: 65 шагов вверх и увидишь то, ради чего сюда пёрлись. 
Сколько в этом строении круглых окон?
<br>
<br>
2 балла
            `,
            `
На каком животном изображён пацифистский значок?
<br>
<img style='height: auto;width: auto; max-width: 250px;max-height: 250px;' src='/statics/clocks.jpg'/>
<br>
<a style="text-decoration:underline !important" href="https://pp.vk.me/c636221/v636221285/753/RcWhArFApUM.jpg">High resolution link</a>
<br>
1 балл

            `,
            {
                type: QuestType.UPLOAD, text: `
Здесь красноармейцы могли бы прогуливаться пешком. Пешком, Карл! Может даже Фридриха бы встретили. 
Принесите фото мата без слов на доске из этого места. 
<br>
<br>
1 балл
            `
            },
            `

1,00 7,00 <br>
1,00 2,00 <br>
4,00 7,00 <br>
4,00 2,00 <br>
5,00 1,20 <br>
5,00 2,00 <br>
7,00 7,00 <br>
7,00 2,00 <br>
10,00 7,00 <br>
10,00 2,00 <br>
12,00 4,50 <br>
12,00 2,00 <br>
12,00 7,00 <br>
15,00 7,00 <br>
15,00 2,00 <br>
16,50 5,00 <br>
16,50 2,00 <br>
18,00 3,50 <br>
19,50 5,00 <br>
19,50 2,00 <br>
21,00 7,00 <br>
21,00 2,00 <br>
24,00 7,00 <br>
24,00 2,00 <br>
<br>
Вам нужен центральный вход. Назовите соседей того, чей труд бесполезен. 
<br>
<br>
2 балла

            `,
            {
                type: QuestType.UPLOAD,
                text: `Сделайте фото всей командой с текущим номером ДММ, расположенном на объекте городской инфрастрктуры (дома, билборды...).. <br><br> 0,5 балла`
            },
            {
                type: QuestType.UPLOAD_5,
                text: `Сделайте фото с числами из последовательности A000055 oeis больше 40 на городских объектах. Одно число должно встречаться не чаще одного раза.<br><br> За одно фото 0,2 балла, максимум 5 фотографий`
            },
            `Переделайте песню Экспонат на математический лад (куплет+припев), запишите на видео и пришлите нам ссылку на загрузку/просмотр видео. <br><br> Максимум 2 балла на усмотрение жюри`,
            {
                type: QuestType.UPLOAD_5,
                text: `Сделайте фото с любой надписью или объектом, имеющим отношение к алгебре или матанализу. Не больше одного одинакового объекта. <br><br>За одно фото 0,1 балла, максимум 5 фотографий`
            },
            `Снимите рекламу вашего любимого учебного курса на матмехе и пришлите нам ссылку на загрузку/просмотр видео. <br><br> Максимум 1 балл на усмотрение жюри`,
            `Принести NPC штраф на имя одного из игроков датированный 17 апреля <br> 0,5 балла
 <br>
 дыню или арбуз, 
 <br>
 0,5 балла`
        ]
    }
};