var all_text:{stages:RawStage[],bonus:RawStage} = {
    stages: [
        {
            name: "Этап «Мост Макарова»",
            quests: [
                `Буря мглою небо кроет 
Вихри снежные крутя
Двигайте своей толпою
От Репера до Меня.
Где под кровлей обветшалой 
Древо чудное стоит,
Шахматист – спортсмен бывалый
Там проводит свой гамбит.
Выпьем, добрая подружка,
Нужен номер игрока.
Выпьем с горя; Где же кружка?
Я за кружкой. Всем пока`,
                `Представьте: exp((-(((x-4)^2+(y-4)^2)^2))/1000)+exp((-(((x+4)^2+(y+4)^2)^2))/1000)+0.15*exp(-(((x+4)^2+(y+4)^2)^2))+0.15*exp(-(((x-4)^2+(y-4)^2)^2)) 
Представили? Возьмите только одну. Подойдите в плотную к морю. Что делал никнейм, когда кто-то ложился спать?`,
                `Эта улица меняла свое название несколько раз. Последнее переименование позже стало связано с УрГУ. Найдите центр улицы. Какой правильный многогранник можно вписать в основание конструкции возле?`,
                "В конце своих приключений Буратино приобрел его, который обязательно бы подошёл к нему. Крупнейшая в Екатеринбурге выставка их соединяет два музея. Переехавший недавно каменный мужик смотрит на нужный. Какой ползучий гад спрятался на камнях возле?",
                "Аудиофайл. Загадано место. Сколько перьев, торчащих из клетки имеют спираль?",
                "На Набережной Рабочей Молодёжи между домами 1 и 3 стоит белый фольксваген 898, там всю команду ждёт Петенька."
            ]
        },
        {
            name: "Этап «Физра не в Павлике»",
            quests: [
                "Сколько ещё говядины надо добавить, чтобы про них можно было петь песню?<br><img style='height: auto;width: auto; max-width: 300px;max-height: 300px;' src='/statics/letters.png'/>",
                "Опытный программист найдёт это место вслепую (2,5) (2,8) (2,7) (1,9) (2,4) (2,9) (3,7)         (2,7) (3,8) (2,7) (2,6) (2,7) (1,6) (2,2). Идите к зданию полному opium des volkes. Сколько трёхмерных гауссиан перед вами?",
                `Здесь
<br>
<br>
<img style='height: auto;width: auto; max-width: 200px;max-height: 200px;' src='/statics/sun.png'/>
<br>
найдите самую высокую площадку.
Среди излюбленных предметов бабушек выберете центральный. Сделайте фото, следуя инструкциям.`,
                "На улице папиного уральца найдите салон, сочетающий красоту с орфографией. Следуя указателю ароматного пара, разыщите предмет-очевидность. Назовите аргументы коньюкции?",
                "Самое время подкрепиться! Встаньте напротив места, где это можно сделать сыто и с огоньком. Следуя за тем, чего хотят все проигравшие, скажите, какой расстояние от фасада является безопасным?"
            ]
        },
        {
            name: "Этап «тУПИк»",
            quests: [
                "Много ли есть в Екатеринбурге памятников, которые стоят на \"своих\" улицах? На одной из таких улиц мы загадали дом с чётным номером N. N mod 100 + N div 100 +1 = M, где M - номер средней образовательной школы в этом доме. Сколько свободных рук у памятника перед ним?",
                "Это место находится между тремя улицами. Первая названа в честь первого, вторая связана с первым пятого, третья носит имя первого кавалера Ордена Красного Знамени. С третьей улицы загляните внутрь и ответьте, почему запрещён въезд?",
                `
В это сложно поверить, но у Пушкина и вот этих девушек есть нечто общее. 
<br>
<img style='height: auto;width: auto; max-width: 200px;max-height: 200px;' src='/statics/girls.jpg'/>
<br>
Номер этого общего состоит из двух цифр. Первая - второе натуральное число, являющееся третьей степенью какого-либо другого натурального числа; второе – сумма цифр самого известного приближения числа пи.
На северо-западе от него дорожный указатель. Расстояние до медвежьей пади?`,
                `
Попробуем вспомнить теорию вероятности. 
<br>
<br>
<img style='height: auto;width: auto; max-width: 500px;max-height: 500px;' src='/statics/formula.png'/>    
<br>
<br>
Так и быть, от вас не требуется применить это неравенство, но хотя бы автора припомните? :) 
Сюрприз-сюрприз, его именем названа улица в нашем городе! 
А на ближайшей параллельной улице на западе находится небольшая аллейка. 
Посреди неё – техническое здание с граффити, которое вам и нужно. 
Справа от центральной девушки, первые четыре буквы после треугольника 
`
            ]
        }
    ],
    bonus: {
        name: "Этап бонус. О программистах",

        quests: [
            ""
        ]
    }
}