import {RawStage} from "../data";

export const stage: RawStage = {
    name: "Модерн",
    internalName: "Динамо",
    quests: [
        "Безконтрольность Челябинской авиационной тропинки приведет вас в это место, над каким материком находится поезд",


        `МММ, а что если убийца — молочник, ДА, пожалуй проверю и эту версию, НО если это НЕ так, то как минимум сузится круг подозреваемых. 
        (вам нужен тот, который ближе всего к азии) какое ограничение есть на знаке`,


        `Все кто тут был или когда нибудь-будет правы по закону! 
 А еще это место созвучно с названием города из Кемеровской области. 
 Когда ты попадешь туда заметишь интересную закономерность.
 В 2015 их было 563, в 2007 - 220 в 2003 -  236
  в 2002 - 217 в 2001 - 147. А если пойти дальше
  в прошлое (примерно метров 130) то вскоре можно увидеть
  будущее, оплетенное паутиной. 
  Вопрос? какой объем этого будущего?`,


        `"Три года назад 36 высоких стройных гигантов, хранивших в себе то светлое, что так дорого простому русскому человеку с треском грохотом и пылью пали под натиском прогресса.
 И даже путь , соединявший их с большой землей, частично убран с глаз. 
 Когда ты пойшмешь что это за путь, пройдись вдоль него туда, где русские женщины знали кому жить хорошо и вскоре ты увидишь призыв кое-кому уходить, вопрос - кому?"`,


        `Можно только позавидовать месным молодым людям: выходя днем или вечером они могут покормить уточек, и вдоволь набегаться, если совсем скучно то пойти собрать радиоприемник.
Когда ты попадешь туда, ты заметишь что тут много названий и путей. Ищи три пути. Не совневайся, их хорошо видно.
Если разгадаешь загадку, то тебя ждет первый, 
если ты это сделаешь не один то только 
благодаря второму, а третий это то, за чем 
ты (или те кто связан с тобой вторым ) 
ездили туда совсем недавно. Когда ты
 найдешь все три в одном месте, скажи 
сколько полных сегментов ты видишь ?`,


        `Эта улица названа не в честь какой-то известной представительницы прекрасной половины человечества как кажется на первый взгляд, а в честь одной из малых рек Екатеринбурга. 
        В районе стадиона до 60-х годов находилось устье. После чего его было решено перенести дальше на 1200 метров в район памятника известной четверки дабы не портить вид. Найдите на улице, названной в честь реки дом, незамкнутый с восточной стороны. 
        Во дворе вас ждет сказка, на строении найдите кого любит Маша Романова`,


        `В нашем городе есть волшебное место выбора пола ребенка для потенциальных родителей. 
        Хоть это и не лампа Аладдина, физическое воздействие тоже самое, хотите девочку "воздействуеете" на левое, мальчика - на правое. 
        Вам нужен дом номер 26 по той же улице, кому посвящено графити с ягодами`,


        `Это сейчас там приличное место и располагается сетевой магазин о котором и не все знают, а раньше во времена сухого закона там отоваривали водочные талоны и знали об этом месте не только жители города, но и области в целом. 
        Найдите во дворе дома 58 по этой же улице представителей известной детской книги. 
        На заборе графити, с какой стороны горы люди из Кургана?`,


        `На улице группы любителей живодерного спорта после тяжелого дня, называвшейся раньше в честь семейства популярного в слободе, в которой Вы сейчас находитесь - есть тупик. 
        В эпсилон окрестности от него - заперт острый и быстрый брат напитка 2007 года. 
        Подойдите к нему, не стоит бояться, он в клетке. Оглядитесь вокруг. 
        Кто является автором персонажа, символом которого является это неприметное существо?`

    ]
}