import {RawStage} from "../data";
import {getVideo} from "./helper";

export const stage: RawStage = {
    name: "Модерн",
    internalName: "Динамо",
    description: getVideo(true, "https://www.youtube.com/embed/7NUpDPaI3M4") +
    `<br><h4>Ватсон за нами погоня, ваша первоочередная задача — следовать указаниям <a href="http://t.me/Wwwatsonbot" />@sherloсkbot (Wwwatsonbot)</a> в телеграмме</h4>`,
    quests: [
        "Кодовое слово, полученное после погони?",


        "Бесконтрольность Челябинской авиационной тропинки приведет вас в это место. Над каким материком находится поезд?",


        `МММ, а что если убийца — молочник? ДА, пожалуй проверю и эту версию, НО если это НЕ так, то как минимум сузится круг подозреваемых. 
(Вам нужен тот, который ближе всего к азии.) Какое ограничение есть на знаке?`,


        `Три года назад 36 высоких стройных гигантов, хранивших в себе то светлое, что так дорого простому русскому человеку, с треском, грохотом и пылью пали под натиском прогресса. 
И даже путь, соединявший их с большой землей, частично убран с глаз. Когда ты поймешь, что это за путь, пройдись вдоль него туда, где русские женщины знали, кому жить хорошо, и вскоре ты увидишь призыв кое-кому уходить. 
Вопрос: кому?`,


        `Эта улица названа не в честь какой-то известной представительницы прекрасной половины человечества, как кажется на первый взгляд, а в честь одной из малых рек Екатеринбурга. 
В районе стадиона до 60-х годов находилось устье. После чего его было решено перенести дальше на 1200 метров в район памятника известной четверки, дабы не портить вид. Найдите на улице, названной в честь реки, дом, незамкнутый с восточной стороны. 
Во дворе вас ждет сказка. На строении найдите, кого любит Маша Романова.`,


        `В нашем городе есть волшебное место выбора пола ребенка для потенциальных родителей. Хоть это и не лампа Аладдина, физическое воздействие то же самое: хотите девочку — "воздействуете" на левое, мальчика — на правое. 
Вам нужен дом №26 по той же улице. Кому посвящено граффити с ягодами?`,


        `Это сейчас там приличное место и располагается сетевой магазин, о котором и не все знают, а раньше, во времена сухого закона, там отоваривали водочные талоны и знали об этом месте не только жители города, но и области в целом. 
Найдите во дворе дома №58 по этой же улице представителей известной детской книги. На заборе граффити. С какой стороны горы люди из Кургана?`,


        `На улице группы любителей живодерного спорта после тяжелого дня, называвшейся раньше в честь семейства популярного в слободе, в которой Вы сейчас находитесь — есть тупик. В эпсилон окрестности от него заперт острый и быстрый брат напитка 2007 года. Подойдите к нему, не стоит бояться — он в клетке. Оглядитесь вокруг. 
Кто автор персонажа, символом которого является это неприметное существо?`

    ],

    bonuses: [
        `Все, кто тут был или когда-нибудь будет, правы по закону! 
А еще это место созвучно с названием города в Кемеровской области. Когда ты попадешь туда, заметишь интересную закономерность. 
В 2015 их было 563, в 2007 - 220, в 2003 - 236, в 2002 - 217, в 2001 - 147. А если пойти дальше в прошлое (примерно метров 130), то вскоре можно увидеть будущее, оплетенное паутиной. 
Вопрос: какой объем этого будущего?`,


        `Можно только позавидовать местным молодым людям: выходя днем или вечером, они могут покормить уточек и вдоволь набегаться, если совсем скучно — пойти собрать радиоприемник. 
Когда ты попадешь туда, заметишь, что тут много названий и путей. Ищи три пути. Не сомневайся, их хорошо видно.
 <br>
Если разгадаешь загадку, то тебя ждет первый; если ты это сделаешь не один, то только благодаря второму; а третий — это то, за чем ты (или те, кто связан с тобой вторым) ездил туда совсем недавно. 
Когда ты найдешь все три в одном месте, скажи, сколько полных сегментов ты видишь?`,

    ]
}